# CombinableElementArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
CombinableElementArray Constructor
CombinableElementArray Class See Also
---
Initializes a new instance of the CombinableElementArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CombinableElementArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CombinableElementArray()
```

# See Also
CombinableElementArray Class
Autodesk.Revit.DB Namespace